export enum P {
	"定制流程1" = "DZ001",
	"定制流程2" = "DZ002",
	"定制流程3" = "DZ003",
	"多原料绑定" = "DZ004",
	"条码关联返工" = "DZ005",
	"扫码登记返工" = "DZ006",
	"氦检数据采集" = "DZ007",
	"条码自配" = "DZ014",
	"打包" = "DZ015",
	"终检" = "DZ016",
}

export enum PK {
	"条码关联" = 1,
	"数据采集",
	"扫码登记",
	"定制流程",
}

export const BarcodeNames : Obj = {
	1: "壳体条码",
	2: "中间条码",
	3: "临时条码",
	4: "客供条码",
}

export const ResultMap = {
	"0": "不合格",
	"1": "合格",
	"2": "待检测",
}

export const resetEquipmentList = [
	'GX-178',
	'GX-179',
	'GX-52',
	'GX-67',
	'GX-69',
	'GX-157',
	'GX-158',
	'GX-159',
	'GX-160',
	'GX-161',
	'GX-162',
	'GX-163',
	'GX-164',
	'GX-165',
	'GX-166',
	'GX-167',
	'GX-177',
	'GX-148',
	'GX-149',
	'GX-150',
	'GX-151',
	'GX-153',
	'GX-154',
	'GX-155',
	'GX-156',
	'GX-117',
	'GX-134',
	'GX-135',
	'GX-136',
	'GX-139',
	'GX-144',
	'GX-145',
	'GX-147',
	'GX-104',
	'STY000014-01',
	'GX-152'
]